simulator-core/src/test/resources/givex/givex_get_balance.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:gvxGlobal="https://gapi.givex.com/1.0/types_global"
xmlns:gvxTrans="https://gapi.givex.com/1.0/types_trans">
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

<SOAP-ENV:Body>
<gvxTrans:GetBalance>
    <id>1</id>
    <givexNumber>1111222233334444</givexNumber>
</gvxTrans:GetBalance>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>